// Напишите программу, которая будет выдавать
// название дня недели по заданному номеру.
// 3 -> Среда
// 5 -> Пятница

Console.Write("Введите целое число: ");
int a = Convert.ToInt32(Console.ReadLine());
if (a > 0 && a < 8);